{
  "basics": {
    "name": "Tom Oeste",
    "label": "Software engineer + product designer",
    "image": "",
    "email": "tomoeste@gmail.com",
    "phone": "410-718-5664",
    "url": "/logo.svg",
    "summary": "I design and deliver quality products. As an agile learner, I thrive with new challenges and diverse teams. My products are used by household name brands and within state and federal government. Strong communication skills are vital to me, as I work remotely with teams distributed around the world. Above all, I value kindness and understanding between people, at work and home.",
    "location": {
      "address": "",
      "postalCode": "21784",
      "city": "Sykesville",
      "countryCode": "US",
      "region": "MD"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "tom-oeste",
        "url": "https://www.linkedin.com/in/tom-oeste/",
        "icon": "fab fa-linkedin"
      },
      {
        "network": "GitHub",
        "username": "tomoeste",
        "url": "https://www.github.com/tomoeste",
        "icon": "fab fa-github"
      },
      {
        "network": "Email",
        "username": "tomoeste",
        "url": "mailto:tomoeste@gmail.com",
        "icon": "fas fa-envelope"
      }
    ]
  },
  "work": [
    {
      "name": "BullsEye Computing Solutions, Inc.",
      "endDate": "",
      "highlights": [],
      "position": "Director of Engineering",
      "startDate": "2012-01-31",
      "summary": "I lead the design and development of BullsEye Mosaic™, a next-generation web app for enterprise inventory and supply chain management. Mosaic an offline-first, mobile-first Progressive Web Application (PWA) built on the ASP.NET Core platform. The Mosaic client side is powered by React and TypeScript. I have overseen marketing campaigns for the company and its products, during which time I led design and development on the corporate website, along with digital and print collateral. I regularly author and edit state and federal contract proposals.\n\n I began my work at BullsEye as an intern, maintaining EZ RF™, gaining expertise with Visual Basic and familiarity with Oracle. I later personally oversaw the implementation of a subversion source code control system, further supplemented with a test case management suite, all through the use of open source software. I was given the role of lead software developer for a federal government project, involving a Visual Basic for Applications (VBA) program in Microsoft Excel with comprehensive data analysis and reporting capabilities.\n\nI returned to BullsEye to serve as a software developer and technical writer for varied state and federal government projects. These projects have been based in product research, solution design, software development, system validation, and proposal writing. I currently serve as the Director of Engineering.",
      "url": "https://www.linkedin.com/company/263785"
    },
    {
      "name": "BullsEye Computing Solutions, Inc.",
      "endDate": "2020-06-30",
      "highlights": [],
      "position": "Business Analyst",
      "startDate": "2016-04-30",
      "summary": "I worked with the Maryland Department of Transportation State Highway Administration (MDOT SHA) to develop functional requirements for a new Consumable Inventory System (CIS). I assisted in facilitating JAD sessions for requirements gathering and developed a variety of document templates and tools to organize and report on the functional requirements. I contributed to several procurement documents, including requests for information and requests for proposals. I performed gap analyses on potential Commercial Off The Shelf (COTS) options against our functional requirements and presented findings to executive leadership. I developed test documentation in the form of test case and test data management tools written as feature-rich Excel workbooks.",
      "url": "https://www.linkedin.com/company/263785"
    },
    {
      "name": "National Institute of Standards and Technology",
      "endDate": "2014-08-31",
      "highlights": [],
      "position": "Guest Researcher",
      "startDate": "2014-05-31",
      "summary": "I returned to NIST through the Summer Undergraduate Research Fellowship to continue my work from the previous summer. I investigated several candidate materials to create a soft tissue biosimulant artifact for safety testing applications in human-robot collaborative environments. The impact testing instrument operates through a LabVIEW interface that I developed the previous summer, and I continued to work with it to characterize damage with the novel biosimulant artifact. I coauthored an academic paper, published in Industrial Robot: An International Journal, on the research that I performed during my time at NIST.",
      "url": "https://www.linkedin.com/company/6357"
    },
    {
      "name": "National Institute of Standards and Technology",
      "endDate": "2013-08-31",
      "highlights": [],
      "position": "Guest Researcher",
      "startDate": "2013-06-30",
      "summary": "I was given the opportunity to work at NIST through the Summer Undergraduate Research Fellowship (SURF) program. I was placed on a project involving robot-human collaborative manufacturing, where I developed a LabVIEW application to acquire and analyze data from an impact testing machine that was designed and fabricated in-house. The application automated both the acquisition and analysis processes, generated graphical representations of the data, and estimated material parameters. I investigated and characterized the properties of skin biosimulants, using the impact instrument and LabVIEW application, to develop a safety-testing process for industrial robots working collaboratively with humans.",
      "url": "https://www.linkedin.com/company/6357"
    },
    {
      "name": "Lab for Physical Sciences",
      "endDate": "2013-06-30",
      "highlights": [],
      "position": "Undergraduate Researcher",
      "startDate": "2012-02-28",
      "summary": "I began working with a UniJet inkjet printer, for which there was no documentation of any kind. Over several months, I authored an illustrated, interactive PDF manual for the operation of the printer hardware and the software controller that accompanied it. While documenting the printing process, I optimized parameters in the software controller, yielding the highest resolution printing observed at the lab. Finally, I made rheological measurements of carbon-nanotube-based conductive inks using a Brookfield viscometer in preparation for printing circuitry on flexible, polymer substrates.",
      "url": ""
    }
  ],
  "education": [
    {
      "institution": "University of Maryland College Park",
      "area": "Systems Engineering",
      "studyType": "Graduate coursework",
      "startDate": "2014-12-31",
      "endDate": "2015-12-31"
    },
    {
      "institution": "University of Maryland College Park",
      "area": "Materials Science and Engineering",
      "studyType": "Bachelor's Degree",
      "startDate": "2010-12-31",
      "endDate": "2014-12-31"
    }
  ],
  "publications": [
    {
      "name": "Human-robot collaboration dynamic impact testing and calibration instrument for disposable robot safety artifacts",
      "publisher": "Industrial Robot: An International Journal",
      "releaseDate": "2016-12-31",
      "website": "http://www.emeraldinsight.com/doi/full/10.1108/IR-06-2015-0125",
      "summary": "The purpose of this paper is a description of DITCI, its drop loads and sensors, the impact tools, the robot dynamic impact safety artifacts, data analysis, and modeling of test results. The dynamic impact testing and calibration instrument (DITCI) is a simple instrument with a significant data collection and analysis capability that is used for the testing and calibration of biosimulant human tissue artifacts. These artifacts may be used to measure the severity of injuries caused in the case of a robot impact with a human."
    }
  ],
  "skills": [
    {
      "name": "ASP.NET Core",
      "description" : "Mosaic is powered by ASP.NET Core"
    },
    {
      "name": "C# + VB",
      "description" : "Mosaic is powered by C#"
    },
    {
      "name": "HTML5",
      "description" : "Mosaic is powered by HMTL5"
    },
    {
      "name": "CSS + SASS",
      "description" : "Mosaic is powered by CSS + SASS"
    },
    {
      "name": "JavaScript + TypeScript",
      "description" : "Mosaic is powered by JS and TS"
    },    
    {
      "name": "React + Redux",
      "description" : "Mosaic is powered by React + Redux"
    },    
    {
      "name": "GraphQL",
      "description" : "Mosaic is powered by GraphQL"
    },
    {
      "name": "SQL + PL/SQL",
      "description" : "Mosaic is powered by SQL"
    },
    {
      "name": "VBA",
      "description" : "I make beautiful, interactive Excel tools with VBA"
    }
  ],
  "expertise": [
    {
      "name": "Software engineering",
      "description" : "I am a self-taught software engineer, but it has become one of my personal passions."
    },
    {
      "name": "Product design",
      "description" : "To me, product design is the confluence of software engineering and user experience."
    },
    {
      "name": "Solution architecture",
      "description" : "I recently designed a progressive web app using ASP.NET Core and React that connects manufacturing and warehouse workers with back office ERP systems. The need for a scalable and reliable modern platform drove me to leverage some of the latest frameworks and libraries."
    },
    {
      "name": "Technical leadership",
      "description" : "I love working with value-driven people, and I am always honored to guide team members toward a common goal."
    },
    {
      "name": "Technical writing",
      "description" : "I take pride in my writing, and I feel like it is more important that ever to communicate clearly and effectively with the people you work with. With teams spread all over the world, and new features being delivered faster each year, the ways in which we communicate are fundamental to our success."
    },    
    {
      "name": "Progressive Web Apps",
      "description" : "The internet has revolutionized our lives, and I believe that we have only seen the beginning. I want to continue to push the boundaries of what website and browsers do."
    },    
    {
      "name": "UI + UX",
      "description" : "I love graphic design, and so it's only natural that I'm drawn to UI design as well. Beyond the aesthetics of a well-designed UI, the concepts at the heart of user experience resonate with me. I believe in creating beauty and sharing joy in all aspects of life. "
    },
    {
      "name": "Mobile applications",
      "description" : "My background is largely centered around creating mobile applications for manufacturing and supply chain users. At the same time, I probably use 20 different apps on my phone every day, and I feel that people will only continue to move more towards mobile platforms as time goes on (whether that includes AR glasses or smart rings - we'll see!)."
    },
    {
      "name": "Inventory management",
      "description" : "I have created products for manufacturing and supply chain users to help manage their inventory by empowering them with simple, inuitive, and modern interfaces to complex (and sometimes dated) backend systems."
    },
    {
      "name": "Barcoding",
      "description" : "Much of my work with inventory management is linked with barcoding. I have written JavaScript libraries to print and scan barcode labels within a web app running on a mobile device with a barcode scanner."
    },
    {
      "name": "Troubleshooting",
      "description" : "Cliche as it may look in a list of areas of expertise, troubleshooting is still one of the absolute core skills for a software engineer to possess. I am proud of my ability to troubleshoot issues, including those that others give up on."
    },
    {
      "name": "Remote collaboration",
      "description" : "The majority of my career has been spent working remotely. While some aspects of it become second nature, others require daily practice to stay effective. I value frequent communication with my colleagues, and I also respect the time that everyone needs to be happy and healthy at home."
    }
  ],
  "languages": [
    {
      "language": "en",
      "fluency": "Native Speaker"
    }
  ],
  "interests": [],
  "references": [],
  "projects": []
}
